CSI API ETABS v1

# cGenDisplSetType Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetType(
    	string Name,
    	int MyType
    )

    Function SetType (
    	Name As String,
    	MyType As Integer
    ) As Integer

    Dim instance As cGenDispl
    Dim Name As String
    Dim MyType As Integer
    Dim returnValue As Integer

    returnValue = instance.SetType(Name, MyType)

    int SetType(
    	String^ Name,
    	int MyType
    )

    abstract SetType :
            Name : string *
            MyType : int -> int

#### Parameters

Name

    Type: SystemString

MyType

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cGenDispl Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com